Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.PartTypeEnum Enumeration
 The types of the physical model part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PartTypeEnum
Public Enumeration PartTypeEnum
Members
Member name | Value | Description
PART | 0 |  The part is a normal part.
BOOLEAN_ADD_PART | 1 |  The part is a boolean add part.
See Also
Reference
Tekla.Structures.Analysis Namespace